Сериализация (в программировании) — процесс перевода какой-
либо структуры данных в последовательность битов. Обратной к
операции сериализации является операция десериализации
(структуризации) — восстановление начального состояния
структуры данных из битовой последовательности.

JSON
• Применяется при передаче данных с клиент<->сервер
• Для сериализации объектов
• Для создания файлов конфигурации
• Везде, где применяется JavaScript, Python. Подходит для
стерилизации составных структур данных из списков и словарей
https://docs.python.org/3/library/json.html

YAML
• Для сериализации объектов
• Для создания файлов конфигурации
• Везде, где применяется JavaScript, Python. Подходит для
стерилизации составных структур данных из списков и словарей
http://pyyaml.org/wiki/PyYAMLDocumentation

XML
• Применяется при передаче данных с клиент<->сервер
• Для сериализации объектов
• Для создания файлов конфигурации
• Применяется повсюду
• Подходит для стерилизации сложных бизнес-объектов
https://docs.python.org/3/library/xml.etree.elementtree.html

CSV
• Для хранения больших объёмов единообразных данных
• Табличный формат
• Используется во всевозможных выгрузках
• Можно экспортировать / импортироваться в excel
https://docs.python.org/3/library/csv.html
